export const RETRIES = 3

export enum AgeLint {
  Start = 'Любой возраст',
  ZeroToNine = '0-9',
  NineToTwelve = '9-12',
  TwelveToSixteen = '12-16',
  SixteenToEighteen = '16-18',
  Adult = '+18',
}

export enum CountryLint {
  Start = 'Любой город',
  'США' = 'США',
  'Россия' = 'Россия',
  'Великобритания' = 'Великобритания',
  'Франция' = 'Франция',
}

export enum FilmAgeLint {
  Start = 'Любая дата',
  '1800-1900' = 'до 1990',
  '1990-2000' = '1990-2000',
  '2000-2010' = '2000-2010',
  '2010-2020' = '2010-2020',
  '2020-2024' = '2020-2024',
}

export enum RatingLint {
  Start = 'Любая оценка',
  '1-10' = 'от 1 звезды',
  '2-10' = 'от 2 звёзд',
  '3-10' = 'от 3 звёзд',
  '4-10' = 'от 4 звёзд',
  '5-10' = 'от 5 звёзд',
  '6-10' = 'от 6 звёзд',
  '7-10' = 'от 7 звёзд',
  '8-10' = 'от 8 звёзд',
  '9-10' = 'от 9 звёзд',
}

export const GenresArray = [
  'биография',
  'боевик',
  'вестерн',
  'военный',
  'детектив',
  'детский',
  'документальный',
  'драма',
  'история',
  'комедия',
  'короткометражка',
  'криминал',
  'мелодрама',
  'музыка',
  'мультфильм',
  'мюзикл',
  'приключения',
  'семейный',
  'спорт',
  'триллер',
  'ужасы',
  'фантастика',
  'фильм-нуар',
  'фэнтези',
]

export const NameContentArray = ['movie', 'tv-series', 'cartoon', 'anime', 'animated-series']
